InformationRegisters/НастройкиУведомлений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject>

  <Properties>
    <Name>НастройкиУведомлений</Name>
    <WriteMode>Exchange</WriteMode>
  </Properties>
  <ChildObjects>
    <Dimension>
      <Name>Клиент</Name>
      <ValueType><v8:Type>cfg:CatalogRef.Клиенты</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.Клиенты</v8:Type></v8:TypeQualifiers></ValueType>
    </Dimension>

    <Resource>
      <Name>Telegram</Name>
      <ValueType><v8:Type>xs:boolean</v8:Type><v8:TypeQualifiers><v8:Type>xs:boolean</v8:Type></v8:TypeQualifiers></ValueType>
    </Resource>

    <Resource>
      <Name>Email</Name>
      <ValueType><v8:Type>xs:boolean</v8:Type><v8:TypeQualifiers><v8:Type>xs:boolean</v8:Type></v8:TypeQualifiers></ValueType>
    </Resource>

    <Resource>
      <Name>SMS</Name>
      <ValueType><v8:Type>xs:boolean</v8:Type><v8:TypeQualifiers><v8:Type>xs:boolean</v8:Type></v8:TypeQualifiers></ValueType>
    </Resource>

    <Attribute>
      <Name>Канал</Name>
      <ValueType><v8:Type>xs:string</v8:Type></ValueType>
    </Attribute>

  </ChildObjects>
</MetaDataObject>

CommonModules/УведомленияСервер/Ext/Module.bsl
// Механизм отправки уведомлений через внешние HTTP/API-сервисы

Функция ОтправитьУведомление(Клиент, ТипУведомления, Текст) Экспорт
	Настройки = ПолучитьНастройкиУведомлений(Клиент);
	Результат = Новый Структура("Отправлено, Ошибка");
	Результат.Отправлено = Ложь;
	Результат.Ошибка = "";

	// Telegram
	Если Настройки.Telegram И Не ПустаяСтрока(Клиент.TelegramID) Тогда
		Ответ = ОтправитьВTelegram(Клиент.TelegramID, Текст);
		Если Ответ Тогда
			Результат.Отправлено = Истина;
		КонецЕсли;
	КонецЕсли;

	// Email
	Если Настройки.Email И Не ПустаяСтрока(Клиент.Email) Тогда
		Ответ = ОтправитьПоЭлектроннойПочте(Клиент.Email, ТипУведомления, Текст);
		Если Ответ Тогда
			Результат.Отправлено = Истина;
		КонецЕсли;
	КонецЕсли;

	Возврат Результат;
КонецФункции

Функция ПолучитьНастройкиУведомлений(Клиент) Экспорт
	Настройки = Новый Структура("Telegram, Email, SMS", Ложь, Ложь, Ложь);
	Отбор = Новый Структура("Клиент", Клиент);
	Записи = РегистрыСведений.НастройкиУведомлений.СоздатьНаборЗаписей();
	Записи.Отбор.Клиент.Установить(Клиент);
	Записи.Прочитать();
	Для Каждого Запись ИЗ Записи Цикл
		Если Запись.Канал = "Telegram" Тогда
			Настройки.Telegram = Запись.Telegram;
		ИначеЕсли Запись.Канал = "Email" Тогда
			Настройки.Email = Запись.Email;
		ИначеЕсли Запись.Канал = "SMS" Тогда
			Настройки.SMS = Запись.SMS;
		КонецЕсли;
	КонецЦикла;
	Возврат Настройки;
КонецФункции

Функция ОтправитьВTelegram(TelegramID, Текст) Экспорт
	HTTPСоединение = Новый HTTPСоединение("api.telegram.org", 443);
	Запрос = Новый HTTPЗапрос("/bot<ТОКЕН>/sendMessage");
	Запрос.УстановитьТелоИзСтроки("chat_id=" + TelegramID + "&text=" + КодироватьСтроку(Текст, СпособКодированияСтроки.КодировкаURL));
	Ответ = HTTPСоединение.Получить(Запрос);
	Возврат Ответ.КодСостояния = 200;
КонецФункции

Функция ОтправитьПоЭлектроннойПочте(Email, Тип, Текст) Экспорт
	// Место для интеграции с внешним SMTP/API-сервисом
	Возврат Истина;
КонецФункции
